app/controllers/posts_controller.rb

  def index
    @posts = Post.order('votes DESC').limit(30)
---
SELECT `posts`.* FROM `posts` ORDER BY votes DESC LIMIT 30